espressif/binutils-esp32ulp/gas/config/tc-esp32ulp_esp32s2.c
#include "tc-esp32ulp_esp32s2.h"
#ifdef TC_ESP32ULP
#include "tc-esp32ulp.h"
#include "opcode/esp32ulp.h"
#include "opcode/esp32ulp_esp32s2.h"

static const char *op = ".__operator";

INSTR_T esp32ulp_gen_wait_esp32s2(void)
{
	unsigned int local_op = OP_CMD_WAIT(0);
	return GEN_OPCODE32_DYA(local_op);
}

INSTR_T esp32ulp_gen_alur_esp32s2(int dst, int src1, int src2, int operation)
{
	//DEBUG_TRACE("dya_pass - esp32ulp_gen_alu_r - dst=%i, src1=%i, src2=%i, op = %i\n", dst, src1, src2, operation);
	unsigned int local_op = I_ALUR(dst, src1, src2, operation);
	return GEN_OPCODE32_DYA(local_op);
}

INSTR_T esp32ulp_gen_alui_esp32s2(int dst, int src1, Expr_Node* addr, int operation)
{
	//DEBUG_TRACE("dya_pass - esp32ulp_gen_alu_i - dst=%i, src1=%i, operation = %i, type=%i, op_value = %i\n", dst, src1, operation, (int)addr->type, (int)addr->value.op_value);
	int imm_val = EXPR_VALUE(addr);
	unsigned int local_op = I_ALUI(dst, src1, imm_val, operation);
	int rel = BFD_RELOC_ESP32S2ULP_ALUI;
	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(addr, rel));
}

INSTR_T esp32ulp_cmd_stage_esp32s2(int dir, Expr_Node* imm)
{
	//DEBUG_TRACE("dya_pass - OP_CMD_STAGE_INC \n");
	int imm_val = EXPR_VALUE(imm);
	unsigned int local_op = I_ALUS(dir, imm_val);

	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(imm, BFD_RELOC_ESP32S2ULP_STAGE));
}

INSTR_T esp32ulp_cmd_stage_rst_esp32s2()
{
	//DEBUG_TRACE("dya_pass - OP_CMD_STAGE_RST \n");
	unsigned int local_op = I_ALUS(ALU_SEL_SRST, 0);

	return GEN_OPCODE32_DYA(local_op);
}

INSTR_T esp32ulp_gen_jump_r_esp32s2(int dst_reg, int cond)
{
	//DEBUG_TRACE("dya_pass - esp32s2ulp_gen_jump_r - dst_reg=%i, cond=%i\n", dst_reg, cond);
	unsigned int local_op = I_JUMP_RI(dst_reg, 0, cond, 1);
	return GEN_OPCODE32_DYA(local_op);
}

INSTR_T esp32ulp_gen_jump_i_esp32s2(Expr_Node* addr, int cond)
{
	int val;
	int rel = 0;

	rel = BFD_RELOC_ESP32S2ULP_16_IMM;

	val = EXPR_VALUE(addr);
	if ((val % 4) != 0) error("%s","Esp32S2Ulp is 32-bit addressing processor. Relative jump value must be divided by 4.");
	unsigned int local_op = I_JUMP_RI(0, val>>2, cond, 0);
	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(addr, rel));
}

INSTR_T esp32ulp_cmd_reg_rd_esp32s2(Expr_Node* addr, Expr_Node* high, Expr_Node* low)
{
	unsigned int addr_val = EXPR_VALUE(addr);
	unsigned int high_val = EXPR_VALUE(high);
	unsigned int low_val = EXPR_VALUE(low);

	if (addr_val > DR_REG_MAX_DIRECT)
	{
		if ((addr_val >= DR_REG_RTCCNTL_BASE) && (addr_val < DR_REG_IO_MUX_BASE))
		{
			addr_val = (addr_val - DR_REG_RTCCNTL_BASE)/4;
		} else {
			error("%s","Register address out of range. Must be 0..0x3ff, or in range of 0x3ff48000 .. 0x3ff49000.");
		}
	}
	unsigned int local_op = I_RD_REG(addr_val, low_val, high_val);

	return conscode(gencode(local_op),
		conctcode(Expr_Node_Gen_Reloc(addr, BFD_RELOC_ESP32S2ULP_REG_RW_ADDR),
		conctcode(Expr_Node_Gen_Reloc(high, BFD_RELOC_ESP32S2ULP_REG_RW_HIGH), Expr_Node_Gen_Reloc(low, BFD_RELOC_ESP32S2ULP_REG_RW_LOW))));
}

INSTR_T esp32ulp_cmd_reg_wr_esp32s2(Expr_Node* addr, Expr_Node* high, Expr_Node* low, Expr_Node* data)
{
	//DEBUG_TRACE("dya_pass - OP_CMD_REG_WR \n");
	unsigned int addr_val = EXPR_VALUE(addr);
	unsigned int high_val = EXPR_VALUE(high);
	unsigned int low_val = EXPR_VALUE(low);
	unsigned int data_val = EXPR_VALUE(data);

	if (addr_val > DR_REG_MAX_DIRECT)
	{
		if ((addr_val >= DR_REG_RTCCNTL_BASE) && (addr_val < DR_REG_IO_MUX_BASE))
		{
			addr_val = (addr_val - DR_REG_RTCCNTL_BASE)/4;
		} else {
			error("%s","Register address out of range. Must be 0..0x3ff, or in range of 0x3ff48000 .. 0x3ff49000.");
		}
	}
	unsigned int local_op = I_WR_REG(addr_val, low_val, high_val, data_val);

	return conscode(gencode(local_op),
		conctcode(Expr_Node_Gen_Reloc(addr, BFD_RELOC_ESP32S2ULP_REG_RW_ADDR),
		conctcode(Expr_Node_Gen_Reloc(data, BFD_RELOC_ESP32S2ULP_REG_RW_DATA),
		conctcode(Expr_Node_Gen_Reloc(high, BFD_RELOC_ESP32S2ULP_REG_RW_HIGH), Expr_Node_Gen_Reloc(low, BFD_RELOC_ESP32S2ULP_REG_RW_LOW)))));
}

INSTR_T esp32ulp_cmd_i2c_rd_esp32s2(Expr_Node* i2c_addr, Expr_Node* high, Expr_Node* low, Expr_Node* i2c_sel)
{
	//DEBUG_TRACE("dya_pass - OP_CMD_I2C_RD \n");
	unsigned int addr_val = EXPR_VALUE(i2c_addr);
	unsigned int high_val = EXPR_VALUE(high);
	unsigned int low_val = EXPR_VALUE(low);
	unsigned int i2c_sel_val = EXPR_VALUE(i2c_sel);

	unsigned int local_op = I_I2C_RW(addr_val, 0, low_val, high_val, i2c_sel_val, OPCODE_I2C_RD);

	return conscode(gencode(local_op),
		conctcode(Expr_Node_Gen_Reloc(i2c_addr, BFD_RELOC_ESP32S2ULP_I2C_RW_ADDR),
		conctcode(Expr_Node_Gen_Reloc(i2c_sel, BFD_RELOC_ESP32S2ULP_I2C_RW_SEL),
		conctcode(Expr_Node_Gen_Reloc(high, BFD_RELOC_ESP32S2ULP_I2C_RW_HIGH), Expr_Node_Gen_Reloc(low, BFD_RELOC_ESP32S2ULP_I2C_RW_LOW)))));
}

INSTR_T esp32ulp_cmd_i2c_wr_esp32s2(Expr_Node* i2c_addr, Expr_Node* high, Expr_Node* low, Expr_Node* i2c_sel, Expr_Node* data)
{
	//DEBUG_TRACE("dya_pass - OP_CMD_I2C_RD \n");
	unsigned int addr_val = EXPR_VALUE(i2c_addr);
	unsigned int high_val = EXPR_VALUE(high);
	unsigned int low_val = EXPR_VALUE(low);
	unsigned int i2c_sel_val = EXPR_VALUE(i2c_sel);
	unsigned int data_val = EXPR_VALUE(data);

	unsigned int local_op = I_I2C_RW(addr_val, data_val, low_val, high_val, i2c_sel_val, OPCODE_I2C_WR);

	return conscode(gencode(local_op),
		conctcode(Expr_Node_Gen_Reloc(i2c_addr, BFD_RELOC_ESP32S2ULP_I2C_RW_ADDR),
		conctcode(Expr_Node_Gen_Reloc(i2c_sel, BFD_RELOC_ESP32S2ULP_I2C_RW_SEL),
		conctcode(Expr_Node_Gen_Reloc(data, BFD_RELOC_ESP32S2ULP_I2C_RW_DATA),
		conctcode(Expr_Node_Gen_Reloc(high, BFD_RELOC_ESP32S2ULP_I2C_RW_HIGH), Expr_Node_Gen_Reloc(low, BFD_RELOC_ESP32S2ULP_I2C_RW_LOW))))));
}




// Conditions for JUMPS instructions
#define JUMPR_EQ 2 
#define JUMPR_GT 1
#define JUMPR_LT 0
#define JUMPR_LE 3
#define JUMPR_GE 4
static int ConvertBrcond2JumpRs2(int cond);
static int ConvertBrcond2JumpRs2(int cond)
{
	int result = JUMPR_EQ;
	switch(cond)
	{
		case BRCOND_EQ:
			result = JUMPR_EQ;
			break;
		case BRCOND_GT:
			result = JUMPR_GT;
			break;
		case BRCOND_LT:
			result = JUMPR_LT;
			break;
		case BRCOND_LE:
			result = JUMPR_LE;
			break;
		case BRCOND_GE:
			result = JUMPR_GE;
			break;
		default:
			printf("ConvertBrcond2JumpRS2 conversion error!!!");
	}
	return result;
}

// Conditions for JUMPS instructions
#define JUMPS_EQ 4 
#define JUMPS_GT 3
#define JUMPS_LT 1
#define JUMPS_LE 5
#define JUMPS_GE 7

static int ConvertBrcond2JumpSs2(int cond);
static int ConvertBrcond2JumpSs2(int cond)
{
	int result = JUMPS_EQ;
	switch(cond)
	{
		case BRCOND_EQ:
			result = JUMPS_EQ;
			break;
		case BRCOND_GT:
			result = JUMPS_GT;
			break;
		case BRCOND_LT:
			result = JUMPS_LT;
			break;
		case BRCOND_LE:
			result = JUMPS_LE;
			break;
		case BRCOND_GE:
			result = JUMPS_GE;
			break;
		default:
			printf("ConvertBrcond2JumpSS2 conversion error!!!");
	}
	return result;
}

INSTR_T esp32ulp_cmd_jump_relr_esp32s2(Expr_Node* step, Expr_Node* thresh, int cond)
{
	cond = ConvertBrcond2JumpRs2(cond);
	int step_val = EXPR_VALUE(step);
	int thresh_val = EXPR_VALUE(thresh);
	if ((cond == JUMPR_LE) || (cond == JUMPR_GE)) // EQ == 3, GT = 4
	{
		unsigned int walk_cond = 0;
		unsigned int result_cond = 0;
		if (cond == JUMPR_LE) // EQ
		{
			//	Jumpr   step, threshold, LT
			//	Jumpr   step, threshold, EQ
			walk_cond = JUMPR_LT;
			result_cond = JUMPR_EQ;
		}
		if (cond == JUMPR_GE) // GT
		{
			//	Jumpr   step,  threshold, GT
			//	Jumpr   step, threshold,  EQ

			walk_cond = JUMPR_GT;
			result_cond = JUMPR_EQ;
		}
		unsigned int local_walk = I_JUMP_RELR(thresh_val, walk_cond, step_val>>2);
		if (step_val < 0) step_val = step_val - 4;
		unsigned int local_result = I_JUMP_RELR(thresh_val, result_cond, step_val>>2);

		INSTR_T result = conscode(gencode(local_result), 
					conctcode(Expr_Node_Gen_Reloc(step, BFD_RELOC_ESP32S2ULP_JUMPR_STEP), 
					Expr_Node_Gen_Reloc(thresh, BFD_RELOC_ESP32S2ULP_JUMPR_THRESH)));
					
