espressif/binutils-esp32ulp/gas/config/tc-esp32ulp_esp32s2.c
		INSTR_T walk1 = conscode(gencode(local_walk), 
					conctcode(Expr_Node_Gen_Reloc(step, BFD_RELOC_ESP32S2ULP_JUMPR_STEP), 
					Expr_Node_Gen_Reloc(thresh, BFD_RELOC_ESP32S2ULP_JUMPR_THRESH)));
					
		INSTR_T last_inst = walk1->next;
		while (last_inst->next)
		{
			last_inst = last_inst->next;
		}
		walk1->mult = 0;
		result->mult = 1;
		last_inst->next = result;
		return walk1;

	} else 
	{
		//DEBUG_TRACE("dya_pass - esp32s2ulp_cmd_jump_relr\n");
		unsigned int local_op = I_JUMP_RELR(thresh_val, cond, step_val>>2);
		return conscode(gencode(local_op), 
					conctcode(Expr_Node_Gen_Reloc(step, BFD_RELOC_ESP32S2ULP_JUMPR_STEP), 
					Expr_Node_Gen_Reloc(thresh, BFD_RELOC_ESP32S2ULP_JUMPR_THRESH)));
	}
}


INSTR_T esp32ulp_cmd_jump_rels_esp32s2(Expr_Node* step, Expr_Node* thresh, int cond)
{
	cond = ConvertBrcond2JumpSs2(cond);
	int step_val = EXPR_VALUE(step);
	int thresh_val = EXPR_VALUE(thresh);
	{
		unsigned int local_op = I_JUMP_RELS(thresh_val, cond, step_val);

		INSTR_T result = conscode(gencode(local_op),
			conctcode(Expr_Node_Gen_Reloc(step, BFD_RELOC_ESP32S2ULP_JUMPR_STEP),
			Expr_Node_Gen_Reloc(thresh, BFD_RELOC_ESP32S2ULP_JUMPS_THRESH)
			)
			);
		
		return result;
	}
		   
}



INSTR_T esp32s2ulp_cmd_sleep_esp32s2(Expr_Node*  cycles)
{
	//DEBUG_TRACE("dya_pass - OP_CMD_SLEEP \n");
	int cycles_val = EXPR_VALUE(cycles);
	unsigned int local_op = OP_CMD_SLEEP(cycles_val);
	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(cycles, BFD_RELOC_ESP32S2ULP_SLEEP));
}

INSTR_T esp32ulp_rd_mem_addr_esp32s2(int lh, int dst_reg, int src_reg, Expr_Node* addr)
{
	//DEBUG_TRACE("dya_pass - esp32s2ulp_rd_mem_addr - dst_reg=%i, src_reg=%i, addr=%i\n", dst_reg, src_reg, (int)0);
	int addr_val = EXPR_VALUE(addr);
	unsigned int local_op = RD_MEM(lh, dst_reg, src_reg, addr_val>>2);// I_JUMP_RELR(0, val, cond, 1);

	int rel = 0;
	rel = BFD_RELOC_ESP32S2ULP_WR_MEM;
	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(addr, rel));
}











INSTR_T esp32ulp_wr_mem_stlh_esp32s2(int low_hi, int dst_reg, int src_reg, Expr_Node *offset)
{
    int addr_val = EXPR_VALUE(offset);
    unsigned int local_op = WR_MEM(dst_reg, src_reg, addr_val >> 2, 0, low_hi, 3, 0x4);

    return conscode(gencode(local_op), Expr_Node_Gen_Reloc(offset, BFD_RELOC_ESP32S2ULP_WR_MEM));
}

INSTR_T esp32ulp_wr_mem_st32_esp32s2(int dst_reg, int src_reg, Expr_Node *offset, Expr_Node *label)
{
	unsigned int label_val = EXPR_VALUE(label);
	unsigned int offset_val = EXPR_VALUE(offset);
	unsigned int local_op = WR_MEM(dst_reg, src_reg, offset_val >> 2, label_val, 0, 0, 0x4);

	return conscode(gencode(local_op),
		conctcode(Expr_Node_Gen_Reloc(offset, BFD_RELOC_ESP32S2ULP_WR_MEM), Expr_Node_Gen_Reloc(label, BFD_RELOC_ESP32S2ULP_WR_MEM_LABEL)));
}

INSTR_T esp32ulp_wr_mem_sti32_esp32s2(int dst_reg, int src_reg, Expr_Node* label)
{
	unsigned int label_val = EXPR_VALUE(label);
	unsigned int local_op = WR_MEM(dst_reg, src_reg, 0, label_val, 0, 0, 0x1);

	return conscode(gencode(local_op),Expr_Node_Gen_Reloc(label, BFD_RELOC_ESP32S2ULP_WR_MEM_LABEL));
}

INSTR_T esp32ulp_wr_mem_st_l_esp32s2(int low_hi, int dst_reg, int src_reg, Expr_Node* offset, Expr_Node* label)
{
	unsigned int label_val = EXPR_VALUE(label);
	unsigned int offset_val = EXPR_VALUE(offset);
	unsigned int local_op = WR_MEM(dst_reg, src_reg, offset_val >> 2, label_val, low_hi, 1, 0x4);

	return conscode(gencode(local_op),
		conctcode(Expr_Node_Gen_Reloc(label, BFD_RELOC_ESP32S2ULP_WR_MEM_LABEL), Expr_Node_Gen_Reloc(offset, BFD_RELOC_ESP32S2ULP_WR_MEM)));
}

INSTR_T esp32ulp_wr_mem_sti_l_esp32s2(int dst_reg, int src_reg, Expr_Node* label)
{
	unsigned int label_val = EXPR_VALUE(label);
	unsigned int local_op = WR_MEM(dst_reg, src_reg, 0, label_val, 0, 1, 0x1);

	return conscode(gencode(local_op),Expr_Node_Gen_Reloc(label, BFD_RELOC_ESP32S2ULP_WR_MEM_LABEL));
}
INSTR_T esp32ulp_wr_mem_sti_esp32s2(int dst_reg, int src_reg)
{
    unsigned int local_op = WR_MEM(dst_reg, src_reg, 0, 0, 0, 3, 0x1);
    return GEN_OPCODE32_DYA(local_op);
}

INSTR_T esp32ulp_wr_mem_sto_esp32s2(Expr_Node* offset)
{
    int addr_val = EXPR_VALUE(offset);
    unsigned int local_op = WR_MEM(0, 0, addr_val >> 2, 0, 0, 0, 0x2);

    return conscode(gencode(local_op), Expr_Node_Gen_Reloc(offset, BFD_RELOC_ESP32S2ULP_WR_MEM));
}


void md_apply_fix_esp32s2(fixS *fixP, valueT *valueP, segT seg ATTRIBUTE_UNUSED)
{
	char *where = fixP->fx_frag->fr_literal + fixP->fx_where;

	long value = *valueP;
	//DEBUG_TRACE("dya_pass - md_apply_fix: fixP->fx_r_type=%i, value=%i, fixP->fx_where=%i\n", fixP->fx_r_type, (unsigned int)value, (int)fixP->fx_where);
	switch (fixP->fx_r_type)
	{
	case BFD_RELOC_ESP32S2ULP_16_IMM:
		if (fixP->fx_addsy != NULL)// relocation will be done not in linker
		{
			asymbol *sym = symbol_get_bfdsym(fixP->fx_addsy);
			int force_reloc = S_FORCE_RELOC(fixP->fx_addsy, 1);
			//printf("force_reloc = %i \n", force_reloc);
			if (force_reloc != 0) if (sym->section->flags != 0) value = value >> 2;
		}
		if ((value < 0) || (value > 2047))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_RELOC_16"));
		if ((value%4) != 0) 
			as_bad_where(fixP->fx_file, fixP->fx_line, _("Esp32S2Ulp is 32-bit addressing processor. Relative jump value must be divided by 4."));

		//value = value << 2;
		md_number_to_chars(where, value, 2);
		break;

	case BFD_RELOC_ESP32S2ULP_JUMPR:
		if (value < -0x8000 || value > 0x7fff)
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_RELOC_ESP32S2ULP_JUMPR"));
		//value = value << 2;
		if (fixP->fx_addsy != NULL)// relocation will be done not in linker
		{
			asymbol *sym = symbol_get_bfdsym(fixP->fx_addsy);
			int force_reloc = S_FORCE_RELOC(fixP->fx_addsy, 1);
			if (force_reloc != 0) if (sym->section->flags != 0) value = value >> 2;
		}
		unsigned int temp_val = 0;
		memcpy(&temp_val, where, 4);
		temp_val &= ~(0xff << 18);
		temp_val |= value;
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32S2ULP_JUMPR temp_val=%08x where[0]=%02x, where[1]=%02x, where[2]=%02x, where[3]=%02x, \n", (unsigned int)temp_val, (unsigned int)where[0], (int)where[1], (int)where[2], (int)where[3]);
		//md_number_to_chars(where, value, 0);
		break;
	case BFD_RELOC_ESP32S2ULP_16_LOAD:
		if (value > 0xffff)
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_LOAD_16"));
		//value = value << 2;
		temp_val = 0;
		memcpy(&temp_val, where, 4);
		temp_val &= ~(0xffff);
		temp_val |= value;
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32S2ULP_16_LOAD temp_val=%08x where[0]=%02x, where[1]=%02x, where[2]=%02x, where[3]=%02x, \n", (unsigned int)temp_val, (unsigned int)where[0], (int)where[1], (int)where[2], (int)where[3]);
		//md_number_to_chars(where, value, 0);
		break;

	case BFD_RELOC_ESP32S2ULP_WR_MEM:
		value = value >> 2;
		if ((value > 2047) || (value < 0))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_WR_MEM"));
		temp_val = 0;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0x7ff << 10));
		temp_val |= (value << 10);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32S2ULP_WR_MEM temp_val=%08x where[0]=%02x, where[1]=%02x, where[2]=%02x, where[3]=%02x, \n", (unsigned int)temp_val, (unsigned int)where[0], (int)where[1], (int)where[2], (int)where[3]);
		//md_number_to_chars(where, value, 0);
		break;
	case BFD_RELOC_ESP32S2ULP_WR_MEM_LABEL:
		if ((value > 3) || (value < 0))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_WR_MEM_LABEL"));
		temp_val = 0;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0x3 << 4));
		temp_val |= (value << 4);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32S2ULP_WR_MEM_LABEL temp_val=%08x where[0]=%02x, where[1]=%02x, where[2]=%02x, where[3]=%02x, \n", (unsigned int)temp_val, (unsigned int)where[0], (int)where[1], (int)where[2], (int)where[3]);
		//md_number_to_chars(where, value, 0);
		break;

	case BFD_RELOC_ESP32S2ULP_ALUI:
		if ((value > 0xffff) || (value < -0xffff))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_ALUI"));
		//value = 0x00ffff; // for tests only
		if (fixP->fx_addsy != NULL)// relocation will be done not in linker
		{
			asymbol *sym = symbol_get_bfdsym(fixP->fx_addsy);
			if (sym->section->flags != 0) value = value >> 2;
		}
		temp_val = 0;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0xffff << 4));
		temp_val |= (value << 4);
		memcpy(where, &temp_val, 4);
		
		//if (fixP->fx_addsy != NULL)
		//{
		//	asymbol *sym = symbol_get_bfdsym(fixP->fx_addsy);
		//	DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32S2ULP_ALUI temp_val=%08x value=%08x, flags=%08x, fixP=%08x, done=%08x, fixP->fx_addsy=%08x, flags=%08x, name=%s\n",
		//		(unsigned int)temp_val, 
		//		(unsigned int)value, (unsigned int)seg->flags, *(unsigned int*)fixP, (unsigned int)fixP->fx_done, *(unsigned int*)fixP->fx_addsy, sym->section->flags, sym->section->name);
		//}
		//else
		//{
		//	DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32S2ULP_ALUI temp_val=%08x value=%08x, flags=%08x, fixP=%08x, done=%08x, fixP->fx_addsy=%08x\n", (unsigned int)temp_val, (unsigned int)value, (unsigned int)seg->flags, *(unsigned int*)fixP, (unsigned int)fixP->fx_done, 0xdead);
		//}
		//md_number_to_chars(where, value, 0);
		break;

	case BFD_RELOC_ESP32S2ULP_WAIT:
		if ((value > 0xffff) || (value < 0))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_WAIT"));
		//value = value << 2;
		temp_val = 0;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0xffff << 0));
		temp_val |= (value << 0);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32S2ULP_WAIT temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		//md_number_to_chars(where, value, 0);
		break;

